# ФОРМУЛЫ
#
# A <= B  >> !A or B
# A == B >> A and B or !A and !B
# A and (A or B) = A // A or A and B = A
# !(A and B) = !A or !B // !(A or B) = !A and !B
# A or B and C == (A or B) and (A or C) // A and (B or C) = A and B or A and C
#
# ==================================================================
# №746 - kompege
# пусть x in A = A и т.д.
# P = [12; 26] и Q = [30; 53]
# ((x in A) <= (x in P)) or (x in Q) = 1
# (A <= P) or Q = 1
# (not A) or P or Q = 1
# ____[12_____26]______[30_____53]______
# => Ответ: 23
# ==================================================================
# №753 - kopege
# P = [5; 30] и Q = [14; 23]
# ((x in p) == (x in Q)) <= not(x in A)  =  1
# (P == Q) <= !A
# !(P == Q) or !A
# !(A and B or !A and !B) or !A
# !(A and B) and !(!A and !B) or !A
# (!P or !Q) and (P or Q) or !A
# ==================================================================
# №1198 - kompege
# B = [18; 52] и C = [16; 41]
# (B <= A) and (!C or A)  =  1
# (!B or A) and (!C or A)
# A or !B and !C
# ___[16_____{18____41]_____52}_______
# значит A от 16 до 52, т.е. ответ: 36
# ==================================================================
# №1320 - kompege
# P = [10; 25] и Q = {15; 30} и R = (25; 40)
# (Q <= !R) and A and !P  =  0
# (!Q or !R) and A and !P  =  0
# !(!Q or !R) or !(A and !P)  =  1
# Q and R or !A or P  =  1
# ____[10____{15____(25]____30}____40)___
# => A = [10; 30] т.е. Ответ: 20