# Первым делом мы должны заменить дефисы,
# т.к. в русском языке слова что-то, кто-нибудь, по-русски и т.д.
# являются одним словом.
# Но редакторы текста воспринимают дефис как разделитель и что-то воспринимается как два разных слова

# Поэтому:
# Ctrl+H
# Найти '-'
# Заменить на ''
# Кнопка "Заменить все"

######################################

# Если просят найти слова, которые встречаются только в составе других слов,
# то находим все слова - слова целиком

######################################

# ТАКЖЕ: справа есть компас - там удаляем всё, что не надо, и только после этого используем
# Ctrl + H